tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "sqlite"
brew "xz"
brew "awscli"
brew "dive"
brew "docker-credential-helper-ecr", link: false
brew "entr"
brew "exa"
brew "fswatch"
brew "gcc"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "hdf5"
brew "htop"
brew "libfido2"
brew "libomp", link: true
brew "mysql"
brew "mysql-client"
brew "mysql@5.7"
brew "neovim"
brew "nghttp2"
brew "parallel"
brew "postgresql@14"
brew "tmux"
brew "tree"
brew "watch"
brew "zsh"
brew "ripgrep"  # Needed for Neovim's Telescope plugin
cask "alacritty"
cask "font-fira-code"
cask "karabiner-elements"
brew "dasel"
