brew "sqlite"
brew "xz"
brew "uv"
brew "mise"
brew "dive"
brew "entr"
brew "eza"
brew "fswatch"
brew "fzf"
brew "gcc"
brew "git"
brew "git-delta"
brew "gnu-sed"
brew "hdf5"  # For XGBoost
brew "htop"
brew "libfido2"
brew "libomp", link: true
brew "neovim"
brew "nghttp2"
brew "parallel"
brew "tmux"
brew "watch"
brew "zsh"
brew "ripgrep"  # Needed for Neovim's Telescope plugin
brew "lynx"  # For improved fetching of url contents with CopilotChat (Neovim)
brew "gh"  # For improved GitHub authorization with CopilotChat (Neovim)
cask "alacritty"
cask "font-fira-code"
cask "karabiner-elements"
brew "dasel"
